{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 53,
   "id": "ce1eb5bf",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "ERROR! Session/line number was not unique in database. History logging moved to new session 43\n"
     ]
    }
   ],
   "source": [
    "import warnings\n",
    "warnings.filterwarnings(\"ignore\")\n",
    "\n",
    "import owlrl\n",
    "from rdflib import Dataset\n",
    "\n",
    "g = Dataset()\n",
    "g.parse(\"SF_ontology_data.ttl\", format=\"turtle\")\n",
    "g.parse(\"SF_ontology.ttl\", format=\"turtle\")\n",
    "#g.parse(\"golem_cleaned.ttl\", format=\"turtle\")\n",
    "\n",
    "# Raisonnement RDFS\n",
    "#owlrl.DeductiveClosure(owlrl.RDFS_Semantics).expand(g)\n",
    "owlrl.DeductiveClosure(owlrl.OWLRL_Semantics).expand(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "id": "da0df784",
   "metadata": {},
   "outputs": [],
   "source": [
    "prefix = \"\"\"\n",
    "PREFIX sf: <https://w3id.org/ontosf/ontology#>\n",
    "PREFIX gc: <https://w3id.org/golem/ontology#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX crm: <http://www.cidoc-crm.org/cidoc-crm/>\n",
    "PREFIX dolce: <http://www.ontologydesignpatterns.org/ont/dlp/DOLCE-Lite.owl#>\n",
    "PREFIX dlp: <http://www.ontologydesignpatterns.org/ont/dlp/>\n",
    "PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "PREFIX vs: <http://www.w3.org/2003/06/sw-vocab-status/ns#>\n",
    "PREFIX csm: <http://www.ontologydesignpatterns.org/ont/dlp/CommonSenseMapping.owl#>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX xml: <http://www.w3.org/XML/1998/namespace> \n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> \n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#> \n",
    "PREFIX vann: <http://purl.org/vocab/vann/> \n",
    "PREFIX dcterms: <http://purl.org/dc/terms/> \n",
    "PREFIX lrm: <http://iflastandards.info/ns/lrm/lrmoo/>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "549e12f1",
   "metadata": {},
   "outputs": [],
   "source": [
    "query = prefix + \"\"\"\n",
    "SELECT ?role ?label (COUNT(?char) AS ?nb) WHERE {   \n",
    "  ?char a gc:G1_Character ;         \n",
    "        gc:GP0_has_feature sf:Female_character ;         \n",
    "        <http://www.ontologydesignpatterns.org/ont/dlp/ExtendedDnS.owl#plays> ?role .   \n",
    "  ?role a gc:G11_Narrative_Role .   \n",
    "  OPTIONAL { ?role rdfs:label ?label . } \n",
    "} \n",
    "GROUP BY ?role ?label \n",
    "ORDER BY DESC(?nb) LIMIT 1\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "id": "6828ac05",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "role                label          nb     \n",
      "------------------------------------------\n",
      "Role_princess       Princess       1      \n"
     ]
    }
   ],
   "source": [
    "def display_results(results):\n",
    "    rows = results \n",
    "    data = []\n",
    "    for row in rows:\n",
    "        data.append([str(val).split(\"#\")[-1] if val else \"(vide)\" for val in row])\n",
    "    \n",
    "    if not data:\n",
    "        print(\"(aucun résultat)\")\n",
    "        return\n",
    "    \n",
    "    vars_ = [str(v) for v in results.vars]\n",
    "    col_widths = [max(len(h), max(len(r[i]) for r in data)) +5 for i, h in enumerate(vars_)]\n",
    "\n",
    "    header = \"  \".join(f\"{h:<{col_widths[i]}}\" for i, h in enumerate(vars_))\n",
    "    separator = \"-\" * len(header)\n",
    "    print(header)\n",
    "    print(separator)\n",
    "    for row in data:\n",
    "        print(\"  \".join(f\"{val:<{col_widths[i]}}\" for i, val in enumerate(row)))\n",
    "\n",
    "results = g.query(query)\n",
    "display_results(results)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
